home-manager/emacs/config.org
#+TITLE: GNU Emacs Config
#+AUTHOR: Léon
#+DESCRIPTION: Léon Emacs Config.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* IMPORTANT PROGRAMS TO LOAD FIRST

** Load Evil Mode
*** Load Evil
#+BEGIN_SRC emacs-lisp
;; Load Evil Mode
(unless (package-installed-p 'evil)
  (package-refresh-contents)
  (package-install 'evil))

;; Tweak Evil's configuration
(setq evil-want-integration t) ;; This is optional since it's already set to t by default.
(setq evil-want-keybinding nil)
(setq evil-vsplit-window-right t)
(setq evil-split-window-below t)

(require 'evil)
(evil-mode 1)
#+END_SRC

*** Load Evil Collection
#+BEGIN_SRC emacs-lisp
;; Load Evil Collection
(unless (package-installed-p 'evil-collection)
  (package-refresh-contents)
  (package-install 'evil-collection))

;; Configure Evil Collection
(require 'evil-collection)
(setq evil-collection-mode-list '(dashboard dired ibuffer))
(evil-collection-init)
#+END_SRC
+END_SRC

** General Keybindings
#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'general)
  (package-refresh-contents)
  (package-install 'general))
(require 'general)
(general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer dt/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode

  (dt/leader-keys
    "b" '(:ignore t :wk "buffer")
    "bb" '(switch-to-buffer :wk "Switch buffer")
    "bk" '(kill-this-buffer :wk "Kill this buffer")
    "bn" '(next-buffer :wk "Next buffer")
    "bp" '(previous-buffer :wk "Previous buffer")
    "br" '(revert-buffer :wk "Reload buffer"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
* Set font and styles
(set-face-attribute 'default nil
                    :font "Fira Code"
                    :height 110
                    :weight 'medium)

(set-face-attribute 'variable-pitch nil
                    :font "Ubuntu"
                    :height 120
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "Fira Code"
                    :height 110
                    :weight 'medium)

;; Make commented text and keywords italic
(set-face-attribute 'font-lock-comment-face nil
                    :slant 'italic)

(set-face-attribute 'font-lock-keyword-face nil
                    :slant 'italic)

;; Set default font on all graphical frames created after restarting Emacs
(add-to-list 'default-frame-alist '(font . "Fira Code-11"))

;; Uncomment the following line if line spacing needs adjusting
(setq-default line-spacing 0.12)
#+END_SRC

* Hide GUI Elements
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+END_SRC

* Display Line Numbers and Truncated Lines
#+BEGIN_SRC emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+END_SRC

* Org Mode Configuration
** Enable Table of Contents
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'toc-org-enable)
#+END_SRC

** Enable Org Bullets
Org-bullets gives us attractive bullets rather than asterisks.
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

* Which-Key Configuration
#+BEGIN_SRC emacs-lisp
(which-key-mode 1)

(setq which-key-side-window-location 'bottom
      which-key-sort-order #'which-key-key-order-alpha
      which-key-sort-uppercase-first nil
      which-key-add-column-padding 1
      which-key-max-display-columns nil
      which-key-min-display-lines 6
      which-key-side-window-slot -10
      which-key-side-window-max-height 0.25
      which-key-idle-delay 0.8
      which-key-max-description-length 25
      which-key-allow-imprecise-window-fit t
      which-key-separator " → ")
#+END_SRC

